app/controllers/friends_controller.rb

    def create
        friend = Friend.new
        friend.name = params[:input_name]
        friend.gender = params[:input_gender]
        friend.age = params[:input_age]
        friend.hobby = params[:input_hobby]
        friend.save
---
INSERT INTO "friends" ("name", "gender", "age", "hobby", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "s"], ["gender", "s"], ["age", 0], ["hobby", "s"], ["created_at", "2018-05-07 10:14:56.101612"], ["updated_at", "2018-05-07 10:14:56.101612"]]

    def show
        @friend = Friend.find params[:id]
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @friend = Friend.find params[:id]
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        friend = Friend.find params[:id]
        friend.name = params[:input_name]
        friend.gender = params[:input_gender]
        friend.age = params[:input_age]
        friend.hobby = params[:input_hobby]
        friend.save
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "friends" SET "name" = ?, "gender" = ?, "age" = ?, "hobby" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["name", "어렵다"], ["gender", "남자"], ["age", 26], ["hobby", "개어려워"], ["updated_at", "2018-05-11 14:42:05.422230"], ["id", 14]]

    def destroy
        @friend = Friend.find params[:id]
        @friend.destroy
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 9]]